
// loglist.push({
//     'title':'Template',
//     'date':"2023.08.19",
//     'log_content':[
//         "",
//         "",
//         "",
//     ]
// }) 


loglist.push({
    'title':'高贵的灵魂，自然都希望能快一点，回天上去。',
    'date':"2024.02.26",
    'log_content':[
        "慢性子都不是什么好东西。",
        "马斯克肯定是被火星鬼上了身。",
        "我又回来了。",
        "又埋了一波。",
        "本巨站应否改名叫“小埋”。"
    ]
}) 

readlist.push({
    'title':'The Limits of Art',
    'log_content':"./data/html/the_limits_of_art.html"
}) 

loglist.push({
    'title':'一动不能动',
    'date':"2024.02.26",
    'log_content':[
        "冥想难道不会进入一个奇怪的空间吗？",
        "那里真的只有纯纯的喜悦？没有妖怪？",
        "“掐指一算”是12进制，60进制是另一只手在掰指头",
        "但为什么不是两只手都“掐指一算”呢？"
    ]
}) 

loglist.push({
    'title':'有没有意识',
    'date':"2024.03.05",
    'log_content':[
        "脑袋里（或者是外）出现过这个问题：“（他）有没有意识”",
        "当时并不知道这是什么意思，刚刚明白了，因为我也用到了这个词。",
        "他的潜台词是：“你有没有意识到你在干嘛！你在（犯罪/杀人/找死/伤到我了）你知道吗？”",
        "是的我当时并没有意识。"
    ]
}) 
