
// contentlist.push({
//     'title':'Template',
//     'date':"2023.08.23",
//     'para':[
//         "",
//         "",
//         "",
//     ]
// }) 



contentlist.push({
    'title':'來自小學數學的覺醒！',
    'date':"2023.08.23",
    'para':[
        "從孩子到成年到中年……硬件是一年不如一年。",
        "軟件還是更重要一些！",
        "關鍵是小學的數學有什麼好研究的，關鍵是小學這個階段，是不是應該是熱身運動啊？如果人不是一年不如一年，這一輩子能爬幾回坡？每回爬幾天？怎麼就不能天天爬？……滾和爬區別在哪？",
        "我不開口人家不確定我是傻子。但願人家看不着吧。山峯風尚下流水，"
    ],
    'show':-1, 
})


contentlist.push({
    'title':'为什么看书？那看成功学好了！',
    'date':"2023.08.23",
    'para':[
        "魔法，魔法师不是魔术师；黑人婴儿洗澡；离场；毒品；",
        "为什么不用微信呢？你怎么总是把事情想得那么复杂？",
        "权力，什么都不是你的，你的电脑不是你的。",
        "Web2.0和web3.0是什么区别来的？",
        "共产主义和资本主义是什么区别来的？",
        "黑猫和白猫到底能干什么来的？",
        "木心说：活着的时候，梦和现实还隔着一层，要死了，才能说XX如梦。但他却躺在床上说梦如XX (xx是“生活”还是“现实”记不清了)。不懂他说的啥意思。",
    ],
    'show':-1, 
})

contentlist.push({
    'title':'不祥的预感',
    'date':"2023.08.23",
    'para':[
        "你说我这脑容量越来越小了呢，刚刚想去微信里找一条刚看过的视频，看了几条后要找什么就忘的一干二净。",
        "还有这两天日本往海里投放核污染水……怎么有种应该戒掉写日记这个习惯的不祥预感。",
        "我想起来了，要找的那条视频是一个穿蓝衣服的人指责另一个穿“日本投降”T的人是“极端民族主义”的视频。底下网友评论大部分说穿蓝衣服的是汉奸，也有很多人支持蓝衣人的说法。我要找这条视频是因为我觉得这个蓝衣服很勇敢啊。",
    ],
    'show':-1, 
})

contentlist.push({
    'title':'战争中的"好人"',
    'date':"2023.08.23",
    'para':[
        "我不想说心里话了. 感觉没什么好处的样子. ",
        "系统性的厌恶. ",
        "上提到'爱国战争', 后现代之前的概念. 人类还能演出什么好戏呢.",
        "'社会权利被膨胀中的大众所有', 能感觉到, 大众统领大众, 精英追随精英. ",
    ],
    'show':-1, 
})

contentlist.push({
    'title':'关于变量命名的问题',
    'date':"2023.08.22",
    'para':[
        "每种编程语言都有自己的一套书写风格. 记不住怎么办? 学了两种就搞混了, 再学第三种, 前面两种都忘了. ",
        "所以干脆自己给自己定一套命名规则吧, 不管用什么语言都这么整.",
        "方案1: ",
        "第一个字母是变量类型的缩写, 如果是DOM后面接dom的类型, 比如p,h1,div什么的. (但别的语言也不涉及到这些东西啊.) 再后面, 接dom的id. (这应该是dom的命名规则.)",
        "函数声明中的形参应该也有自己的命名规则. 比如`pm`开头, 后面接变量类型比如`pmInt_`, 然后后面再接个有意义的名字, 而且一个函数的形参可能是它内部函数的实参. 这就有点乱了",
    ],
    'show':-1, 
    // [-1]: show all lines;   [0]: hide;   [n>0]: show n lines;   [null or don't set]: default show 3 lines.
    // excrete, 排泄
})


/*

形参是parameter，实参是argument。

paragraph
段, 段落, 款, 一段

passage
通道, 篇 文章, 段落, 推移, 流逝, 通行

para
段, 旁, 帕拉, 巴拉, 段落

*/


contentlist.push({
    'title':'过去的事, 就让他过去吧.',
    'date':"2023.08.22",
    'para':[
        "天知地知你知我知, 谁看着谁倒霉. 翻片了. ",
        "从明天睡醒觉开始, 好好研究研究小学数学的事. ... 怎么头脑变得这么简单呢. 急速退化.",
        "平面设计的事到底干不干了呢? 要干,怎么干? 这么混下去...混着玩么? 换换脑筋当休息? 感觉不合适. ",
        "我应该改回去用windows是不是? 还是说...windows真是越来越好用了, 但是ubuntu开源啊.",
        "还有python, 学了不用, 还不得也忘个精精光光?",
        "还有C语言, 算法, 美学书, 摄影书...还有密码学, 研究不了? 咱以前还做了半套字体呢. 在家干待了小十年, 最后就作出这么个东西? ",
        "为什么不直接在多级目录下用文本文件记录日志呢? 因为网页比文本文件回顾方便. 文本文件无法格式化, 阅读起来太难受了."
    ],
    'show':null, 
})






