
// contentlist.push({
//     'title':'Template',
//     'date':"2023.08.23",
//     'para':[
//         "",
//         "",
//         "",
//     ]
// }) 


contentlist.push({
    'title':'过去的事, 就让他过去吧.',
    'date':"2023.08.22",
    'para':[
        "天知地知你知我知, 谁看着谁倒霉. 翻片了. ",
        "从明天睡醒觉开始, 好好研究研究小学数学的事. ... 怎么头脑变得这么简单呢. 急速退化.",
        "平面设计的事到底干不干了呢? 要干,怎么干? 这么混下去...混着玩么? 换换脑筋当休息? 感觉不合适. ",
        "我应该改回去用windows是不是? 还是说...windows真是越来越好用了, 但是ubuntu开源啊.",
        "还有python, 学了不用, 还不得也忘个精精光光?",
        "还有C语言, 算法, 美学书, 摄影书...还有密码学, 研究不了? 咱以前还做了半套字体呢. 在家干待了小十年, 最后就作出这么个东西? ",
        "为什么不直接在多级目录下用文本文件记录日志呢? 因为网页比文本文件回顾方便. 文本文件无法格式化, 阅读起来太难受了."
    ],
    'isshit':true,
    'show':-1, // [-1]: show all lines;   [0]: hide;   [n>0]: show n lines;   [null or don't set]: default show 3 lines.
})






